Table of Contents
 Class DesignMemberInSubStructure
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
DesignMemberInSubStructure
[OpenModelClass("CI.StructModel.Structure.DesignMemberInSubStructure, CI.StructuralElements", "CI.StructModel.Structure.IDesignMemberInSubStructure,CI.BasicTypes")]
public class DesignMemberInSubStructure : OpenObject
Inheritance
object
OpenObject
DesignMemberInSubStructure
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 DesignMember
Reference to DesignMember
public ReferenceElement DesignMember { get; set; }
Property Value
ReferenceElement
 Edit this page